//=============================================================================
//
// ポーズ処理 [pause.cpp]
// Author : 竹内亘
//
//=============================================================================
#include "pause.h"
#include "manager.h"
#include "renderer.h"
#include "input.h"
#include "fade.h"
#include "pausemat.h"
#include "pauseselect.h"
#include "sound.h"

//=============================================================================
// 静的メンバ変数
//=============================================================================
CPauseSelect *CPause::m_PauseSelect = NULL;
CPauseMat *CPause::m_PauseMat = NULL;

//=============================================================================
// コンストラクタ
//=============================================================================
CPause::CPause()
{

}
//=============================================================================
// デストラクタ
//=============================================================================
CPause::~CPause()
{

}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CPause::Init()
{
	m_PauseMat = CPauseMat::Create(D3DXVECTOR3(SCREEN_WIDTH / 2.0f, SCREEN_HEIGHT / 2.0f, 0.0f));
	m_PauseSelect = CPauseSelect::Create();

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void CPause::Uninit(void)
{
	if (m_PauseMat != NULL)
	{
		m_PauseMat->Uninit();
		m_PauseMat = NULL;
	}

	if (m_PauseSelect != NULL)
	{
		m_PauseSelect->Uninit();
		m_PauseSelect = NULL;
	}
}
//=============================================================================
// 更新処理
//=============================================================================
void CPause::Update(void)
{
	// サウンドの取得
	CSound * pSound = CManager::GetSound();

	if (m_PauseSelect != NULL)
	{
		m_PauseSelect->Update();
	}
}
//=============================================================================
// 描画処理
//=============================================================================
void CPause::Draw(void)
{
	if (m_PauseMat != NULL)
	{
		m_PauseMat->Draw();
	}

	if (m_PauseSelect != NULL)
	{
		m_PauseSelect->Draw();
	}
}
//=============================================================================
// 生成
//=============================================================================
CPause * CPause::Create()
{
	CPause *pPause = NULL;

	if (pPause == NULL)
	{
		pPause = new CPause;

		if (pPause != NULL)
		{
			pPause->Init();
		}
	}
	return pPause;
}